import pytest

import pandas as pd


@pytest.fixture
def transactions_df() -> pd.DataFrame:
    data = pd.DataFrame({"Категория": ["Супермаркеты",
                                       "Одежда",
                                       "Рестораны",
                                       "Супермаркеты",
                                       "Супермаркеты",
                                       "Супермаркеты"],
                         "Дата операции": ["31.12.2021 16:44:00",
                                           "30.12.2021 16:44:00",
                                           "30.12.2021 16:44:00",
                                           "30.12.2021 16:44:00",
                                           "29.11.2021 16:44:00",
                                           "27.07.2024 16:44:00"],
                         "Сумма операции": [-1,
                                            -2,
                                            -3,
                                            -4,
                                            -5,
                                            -6],
                         "Кэшбэк": [10, 20, 0, 30, 40, 50],
                         "Номер карты": ["*1111", "*1111", "*2222", "*2222", "*3333", "*3333"],
                         "Описание": ["Операция 1", "Операция 2", "Операция 3",
                                      "Операция 4", "Операция 5", "Операция 6"]},
                        index=[0, 1, 2, 3, 4, 5])

    return data


@pytest.fixture
def res_spending_by_category() -> pd.DataFrame:
    data = pd.DataFrame({"Категория": ["Супермаркеты", "Супермаркеты"],
                         "Дата операции": ["31.12.2021 16:44:00", "30.12.2021 16:44:00"],
                         "Сумма операции": [-1, -4],
                         "Кэшбэк": [10, 30],
                         "Номер карты": ["*1111", "*2222"],
                         "Описание": ["Операция 1", "Операция 4"]},
                        index=[0, 3])
    return data


@pytest.fixture
def res_spending_by_category_without_date() -> pd.DataFrame:
    data = pd.DataFrame({"Категория": ["Супермаркеты"],
                         "Дата операции": ["27.07.2024 16:44:00"],
                         "Сумма операции": [-6],
                         "Кэшбэк": [50],
                         "Номер карты": ["*3333"],
                         "Описание": ["Операция 6"]},
                        index=[5])
    return data


@pytest.fixture
def res_spending_by_category_empty() -> pd.DataFrame:
    data = pd.DataFrame({"Категория": [],
                         "Дата операции": [],
                         "Сумма операции": [],
                         "Кэшбэк": [],
                         "Номер карты": [],
                         "Описание": []},
                        index=[])
    return data


@pytest.fixture()
def cashback_12() -> str:
    data = """{"Супермаркеты": 40, "Одежда": 20}"""
    return data


@pytest.fixture()
def res_get_data_filter_by_date() -> pd.DataFrame:
    data = pd.DataFrame({"Категория": ["Супермаркеты",
                                       "Одежда",
                                       "Рестораны",
                                       "Супермаркеты"],
                         "Дата операции": ["31.12.2021 16:44:00",
                                           "30.12.2021 16:44:00",
                                           "30.12.2021 16:44:00",
                                           "30.12.2021 16:44:00"],
                         "Сумма операции": [-1,
                                            -2,
                                            -3,
                                            -4],
                         "Кэшбэк": [10, 20, 0, 30],
                         "Номер карты": ["*1111", "*1111", "*2222", "*2222"],
                         "Описание": ["Операция 1", "Операция 2", "Операция 3", "Операция 4"]},
                        index=[0, 1, 2, 3])

    return data


@pytest.fixture()
def top_transactions_df() -> list[dict]:
    data = [{"date": "27.07.2024 16:44:00", "amount": -6, "category": "Супермаркеты", "description": "Операция 6"},
            {"date": "29.11.2021 16:44:00", "amount": -5, "category": "Супермаркеты", "description": "Операция 5"},
            {"date": "30.12.2021 16:44:00", "amount": -4, "category": "Супермаркеты", "description": "Операция 4"},
            {"date": "30.12.2021 16:44:00", "amount": -3, "category": "Рестораны", "description": "Операция 3"},
            {"date": "30.12.2021 16:44:00", "amount": -2, "category": "Одежда", "description": "Операция 2"}]
    return data
